# Tableau Preliminary EDA Visualizations

The links for the interactive versions on Tableau Public are:

[NYC Metro Area](https://public.tableau.com/views/DataKIndUCCDACProjectPreliminaryEDA-NYCMetro/NYCMetroArea?:language=en-US&:display_count=n&:origin=viz_share_link)
[NYC Metro Area Panel](https://public.tableau.com/views/DataKIndCDACProjectVisualization-NYCMetro2/Dashboard2?:language=en-US&:display_count=n&:origin=viz_share_link)


I have revised the NYC visualization to incorporate my most recent changes in dataframe. Still unsure about the headings in ACS database.  I implemented teamookla's method of joining the Ookla and FCC dataset.  It also involved having two geodataframes.  I went to the ookla folder to use a different cvs or zip file that was the type of geodataframe, but did not have the `tile` column.  I joined the dataframes using `geopandas.sjoin`, as per teamookla's notebook. I also implemented a fellow colleague's method of aggregating in task 1A.  The four visualizations are on a dashboard where you select which visualization is presented to the user, but I am brainstorming a more effective way of presenting the data.

If you hover over each tract, I have provided the other relevant information on the FCC and Oookla visualizations as visualized below.

https://github.com/teamookla/ookla-open-data/blob/352915afe9fd88eec16fd9814812a8a977f9e04a/tutorials/aggregate_by_county_py.ipynb

Any feedback or suggestions would be greatly appreciated.

<img src="images/graph1.png">

<img src="images/graph2.png">

<img src="images/graph3.png">

<img src="images/graph4.png">

<img src="images/panel.png">

In [6]:
import pandas as pd

# Set maximum number of rows and columns that can be viewed
pd.set_option("display.max_columns", 100)
pd.set_option('display.max_rows', 100)

In [3]:


df = pd.read_excel("data/Census_Tracts.xlsx")
df.head()

,2,GEOID,NAME Geographic Area Name,NAME Geographic Area Name - Split 1,NAME Geographic Area Name - Split 2,P1 001N,P1 002N,P1 003N,P1 004N,P1 005N,...,P1 062N,P1 063N,P1 064N,P1 065N,P1 066N,P1 067N,P1 068N,P1 069N,P1 070N,P1 071N
0,1400000US36001000100,36001000100,"Census Tract 1, Albany County, New York",1.00,Albany,2073,1865,388,1279,6,...,0,0,0,0,0,0,0,0,0,0
1,1400000US36001000201,36001000201,"Census Tract 2.01, Albany County, New York",2.01,Albany,3125,2892,587,2027,30,...,0,0,0,0,0,0,0,0,0,0
2,1400000US36001000202,36001000202,"Census Tract 2.02, Albany County, New York",2.02,Albany,2598,2389,224,1898,8,...,0,0,0,0,0,0,0,0,0,0
3,1400000US36001000301,36001000301,"Census Tract 3.01, Albany County, New York",3.01,Albany,3190,2845,586,1919,25,...,0,0,0,0,0,0,0,0,0,0
4,1400000US36001000302,36001000302,"Census Tract 3.02, Albany County, New York",3.02,Albany,3496,3224,1982,677,9,...,0,0,0,0,0,0,0,0,0,0

In [4]:
df = df[['GEOID', 'NAME Geographic Area Name - Split 1', 'NAME Geographic Area Name - Split 2']]
df.columns = ['GEOID', 'Census Tract', 'County']
df.head()

         GEOID  Census Tract  County
0  36001000100          1.00  Albany
1  36001000201          2.01  Albany
2  36001000202          2.02  Albany
3  36001000301          3.01  Albany
4  36001000302          3.02  Albany

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5411 entries, 0 to 5410
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   GEOID         5411 non-null   int64
 1   Census Tract  5411 non-null   float64
 2   County        5411 non-null   object
dtypes: float64(1), int64(1), object(1)
memory usage: 126.9+ KB

In [6]:
df.GEOID = df.GEOID.astype(str)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5411 entries, 0 to 5410
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   GEOID         5411 non-null   object
 1   Census Tract  5411 non-null   float64
 2   County        5411 non-null   object
dtypes: float64(1), object(2)
memory usage: 126.9+ KB

In [8]:
data = pd.read_excel('data/NY/Tract_to_NTA.xlsx', header=3, 
                                                  skiprows=1, 
                                                  converters={'2010 Census Bureau FIPS County Code': str, '2010 NYC Borough Code': str, '2010 Census Tract': str, 'PUMA': str, 'GEOID': str})
data = data.reset_index(drop=True)
data.columns = ['Borough', 'County FIPS', 'Borough Code', 'Tract FIPS', 'PUMA', 'NTA Code', 'NTA Name', 'GEOID']
data.head()

,Borough,County FIPS,Borough Code,Tract FIPS,PUMA,NTA Code,NTA Name,GEOID
0,Bronx,5,2,31000,3704,BX31,Allerton-Pelham Gardens,36005031000
1,Bronx,5,2,31200,3704,BX31,Allerton-Pelham Gardens,36005031200
2,Bronx,5,2,31400,3704,BX31,Allerton-Pelham Gardens,36005031400
3,Bronx,5,2,31600,3704,BX31,Allerton-Pelham Gardens,36005031600
4,Bronx,5,2,31800,3704,BX31,Allerton-Pelham Gardens,36005031800

In [9]:
data.GEOID = data.GEOID.astype(str)

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2168 entries, 0 to 2167
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Borough       2168 non-null   object
 1   County FIPS   2168 non-null   int64
 2   Borough Code  2168 non-null   int64
 3   Tract FIPS    2168 non-null   int64
 4   PUMA          2168 non-null   int64
 5   NTA Code      2168 non-null   object
 6   NTA Name      2168 non-null   object
 7   GEOID         2168 non-null   object
dtypes: int64(4), object(4)
memory usage: 135.6+ KB

In [11]:
joined = df.merge(data, how='left', on='GEOID')
joined

,GEOID,Census Tract,County,Borough,County FIPS,Borough Code,Tract FIPS,PUMA,NTA Code,NTA Name
0,36001000100,1.00,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,36001000201,2.01,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,36001000202,2.02,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,36001000301,3.01,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,36001000302,3.02,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
5406,36123150301,1503.01,Yates,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5407,36123150302,1503.02,Yates,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5408,36123150400,1504.00,Yates,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5409,36123150501,1505.01,Yates,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5410,36123150502,1505.02,Yates,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
joined['NTA Code'].value_counts()

BK50    32
BK31    28
BK88    28
BK58    27
BK28    26
        ..
QN02     2
SI32     2
MN50     2
BK93     2
BX98     1
Name: NTA Code, Length: 194, dtype: int64

In [13]:
joined.drop(columns=['Census Tract'], inplace=True)
joined.head()

,GEOID,County,Borough,County FIPS,Borough Code,Tract FIPS,PUMA,NTA Code,NTA Name
0,36001000100,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,36001000201,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,36001000202,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,36001000301,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,36001000302,Albany,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
joined.to_csv('data/NY/NY_Names.csv')

In [14]:
joined['NTA Name'].value_counts()

Canarsie                          32
Bay Ridge                         28
Borough Park                      28
Flatlands                         27
Bensonhurst West                  26
                                  ..
Springfield Gardens North          2
Rossville-Woodrow                  2
Stuyvesant Town-Cooper Village     2
Starrett City                      2
Rikers Island                      1
Name: NTA Name, Length: 194, dtype: int64

In [15]:
joined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5411 entries, 0 to 5410
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   GEOID         5411 non-null   object
 1   County        5411 non-null   object
 2   Borough       2036 non-null   object
 3   County FIPS   2036 non-null   float64
 4   Borough Code  2036 non-null   float64
 5   Tract FIPS    2036 non-null   float64
 6   PUMA          2036 non-null   float64
 7   NTA Code      2036 non-null   object
 8   NTA Name      2036 non-null   object
dtypes: float64(4), object(5)
memory usage: 422.7+ KB

In [46]:
import geopandas as gpd

chicago_ct = gpd.read_file('data/IL/Chicago Census Tracts.geojson')
chicago_ct.head()

,statefp10,name10,commarea_n,namelsad10,commarea,geoid10,notes,tractce10,countyfp10,geometry
0,17,8424,44,Census Tract 8424,44,17031842400,,842400,031,"MULTIPOLYGON (((-87.62405 41.73022, -87.62405 ..."
1,17,8403,59,Census Tract 8403,59,17031840300,,840300,031,"MULTIPOLYGON (((-87.68608 41.82296, -87.68607 ..."
2,17,8411,34,Census Tract 8411,34,17031841100,,841100,031,"MULTIPOLYGON (((-87.62935 41.85280, -87.62934 ..."
3,17,8412,31,Census Tract 8412,31,17031841200,,841200,031,"MULTIPOLYGON (((-87.68813 41.85569, -87.68816 ..."
4,17,8390,32,Census Tract 8390,32,17031839000,,839000,031,"MULTIPOLYGON (((-87.63312 41.87449, -87.63306 ..."

In [25]:
len(chicago_ct)

801

In [4]:
chicago_ct.geoid10.nunique()

801

In [47]:
chicago_ca = gpd.read_file('data/IL/Chicago Community Areas.geojson')
chicago_ca.head()

,community,area,shape_area,perimeter,area_num_1,area_numbe,comarea_id,comarea,shape_len,geometry
0,DOUGLAS,0,46004621.1581,0,35,35,0,0,31027.0545098,"MULTIPOLYGON (((-87.60914 41.84469, -87.60915 ..."
1,OAKLAND,0,16913961.0408,0,36,36,0,0,19565.5061533,"MULTIPOLYGON (((-87.59215 41.81693, -87.59231 ..."
2,FULLER PARK,0,19916704.8692,0,37,37,0,0,25339.0897503,"MULTIPOLYGON (((-87.62880 41.80189, -87.62879 ..."
3,GRAND BOULEVARD,0,48492503.1554,0,38,38,0,0,28196.8371573,"MULTIPOLYGON (((-87.60671 41.81681, -87.60670 ..."
4,KENWOOD,0,29071741.9283,0,39,39,0,0,23325.1679062,"MULTIPOLYGON (((-87.59215 41.81693, -87.59215 ..."

In [26]:
len(chicago_ca)

77

In [66]:
chicago_ca.to_crs('EPSG:4326')
chicago_ct.to_crs('EPSG:4326')

chicago_ca['centroid'] = chicago_ca.centroid
chicago_ct['centroid'] = chicago_ct.centroid

/var/folders/0f/dj_hz1316w7c4qhdk33w3p3w0000gn/T/ipykernel_31061/541520742.py:4: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  chicago_ca['centroid'] = chicago_ca.centroid
/var/folders/0f/dj_hz1316w7c4qhdk33w3p3w0000gn/T/ipykernel_31061/541520742.py:5: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  chicago_ct['centroid'] = chicago_ct.centroid

In [78]:
chicago_ct.set_geometry('centroid')
chicago_ca.set_geometry('geometry')

chicago_join = gpd.sjoin(chicago_ct, chicago_ca, op='intersects', how='inner')
chicago_join.head()

,statefp10,name10,commarea_n,namelsad10,commarea,geoid10,notes,tractce10,countyfp10,geometry,centroid_left,index_right,community,area,shape_area,perimeter,area_num_1,area_numbe,comarea_id,comarea,shape_len,centroid_right
0,17,8424,44,Census Tract 8424,44,17031842400,,842400,031,"MULTIPOLYGON (((-87.62405 41.73022, -87.62405 ...",POINT (-87.63004 41.74248),46,ROSELAND,0,134313706.73,0,49,49,0,0,56632.7954292,POINT (-87.62337 41.70659)
12,17,5401.02,54,Census Tract 5401.02,54,17031540102,,540102,031,"MULTIPOLYGON (((-87.61885 41.65642, -87.61892 ...",POINT (-87.60545 41.66733),46,ROSELAND,0,134313706.73,0,49,49,0,0,56632.7954292,POINT (-87.62337 41.70659)
198,17,8340,49,Census Tract 8340,49,17031834000,,834000,031,"MULTIPOLYGON (((-87.63345 41.72204, -87.63347 ...",POINT (-87.62950 41.72754),46,ROSELAND,0,134313706.73,0,49,49,0,0,56632.7954292,POINT (-87.62337 41.70659)
238,17,5301,53,Census Tract 5301,53,17031530100,,530100,031,"MULTIPOLYGON (((-87.62020 41.68535, -87.62001 ...",POINT (-87.61794 41.68185),46,ROSELAND,0,134313706.73,0,49,49,0,0,56632.7954292,POINT (-87.62337 41.70659)
243,17,4909.02,49,Census Tract 4909.02,49,17031490902,,490902,031,"MULTIPOLYGON (((-87.61967 41.69943, -87.62033 ...",POINT (-87.61533 41.70328),46,ROSELAND,0,134313706.73,0,49,49,0,0,56632.7954292,POINT (-87.62337 41.70659)

In [79]:
len(chicago_join)

1642

In [82]:
df = pd.DataFrame(chicago_join.geoid10.value_counts())
df

             geoid10
17031470100        7
17031843200        6
17031835600        5
17031200100        5
17031838800        5
...              ...
17031292200        1
17031838200        1
17031833300        1
17031832900        1
17031090100        1

[801 rows x 1 columns]

In [83]:
df[df.geoid10 > 1]

             geoid10
17031470100        7
17031843200        6
17031835600        5
17031200100        5
17031838800        5
...              ...
17031020901        2
17031839200        2
17031700501        2
17031730201        2
17031730202        2

[549 rows x 1 columns]

In [45]:
chicago_join.to_file('chicago.geojson', driver='GeoJSON')